---
kind: other
id: Properties.T:Autodesk.Revit.DB.LineProperties
source: html/9fb36d1f-1b31-57b4-7bfc-65e1ce179060.htm
---
# LineProperties Properties

The current color used when drawing lines/curves.